const mapData = {
  "areas": [
    {
      "name": "الحجاز",
      "coordinates": [
        [
          28.01380137638074,
          35.17822265625001
        ],
        [
          28.6135,
          36.98
        ],
        [
          23.3423,
          42.0337
        ],
        [
          18.7711,
          44.3408
        ],
        [
          17.8951,
          41.5283
        ],
        [
          21.197216077387107,
          39.19921875000001
        ],
        [
          23.6445,
          38.6279
        ],
        [
          24.4471,
          37.4414
        ]
      ]
    }
  ],
  "cities": [
    {
      "name": "مكة المكرمة",
      "coordinates": [
        21.4225,
        39.8262
      ],
      "type": "city",
      "additional_info": "موطن النبي صلى الله عليه وسلم"
    }
  ],
  "locations": [
    {
      "name": "سوق عكاظ",
      "coordinates": [
        21.50432123460369,
        40.693911466586734
      ],
      "type": "historical",
      "additional_info": "من اشهر اسواق العرب قديما",
      "description": "سوق"
    }
  ]
};